tutorials/cases/flatPlate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       79500;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       79600;
    }
    inlet
    {
        type            patch;
        nFaces          360;
        startFace       79700;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       80060;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          80000;
        startFace       80460;
    }
    inlet_porous
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       160460;
    }
)

// ************************************************************************* //
