tutorials/cases/flatPlate/constant/reactions
species
(
    N2
    O2
);

reactions
(
);
